Repository: 84000/data-translation-memory
Catalog: toh62-v3.tmx
Source language: bo
Languages: en

source: འཕགས་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཞུས་པ་ཞེས་བྱ་བ་ཐེག་པ་ཆེན་པོའི་མདོ།།
en: The Questions of Rāṣṭrapāla

source: །།སངས་རྒྱས་དང་བྱང་ཆུབ་སེམས་དཔའ་ཐམས་ཅད་ལ་ཕྱག་འཚལ་ལོ།
en: Homage to all buddhas and bodhisattvas!

source: །འདི་སྐད་བདག་གིས་ཐོས་པ་དུས་གཅིག་ན།
en: Thus have I heard at one time.

source: བཅོམ་ལྡན་འདས་རྒྱལ་པོའི་ཁབ་ན་བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ལ་དགེ་སློང་སྟོང་ཉིས་བརྒྱ་ལྔ་བཅུའི་དགེ་སློང་གི་དགེ་འདུན་ཆེན་པོ་དང་། བྱང་ཆུབ་སེམས་དཔའ་ལྔ་སྟོང་ཐམས་ཅད་ཀྱང་སྤོབས་པ་ཐོགས་པ་མེད་པ། བཟོད་པ་ཐོབ་པ། བདུད་ཕྱིར་རྒོལ་བ་བཅོམ་པ། སངས་རྒྱས་ཀྱི་ཆོས་ཐམས་ཅད་ལ་ཤིན་ཏུ་ཉེ་བར་གྱུར་པ། སྐྱེ་བ་གཅིག་གིས་ཐོགས་པ། གཟུངས་ཐོབ་པ།
en: In Rājagṛha, on the Vulture’s Peak, the Bhagavān was residing together with a great assembly of one thousand two hundred fifty monks and five thousand bodhisattvas, whose eloquence was unimpeded, who were endowed with patience, who had conquered the hostile māras, who were very close to realizing all the buddha qualities, who were impeded by only one birth, who had attained concentration and retention, who had reached limitless eloquence and unimpeded fearlessness, who had obtained magical power and the ultimate perfection of power, and who had appropriated all inexhaustible collections of good qualities without exception.

source: ཏིང་ངེ་འཛིན་ཐོབ་པ།
en: The bodhisattvas present included the bodhisattva mahāsattvas Samantabhadra, Samantanetra, Samantāvalokita, Samantaraśmi, Samantaprabha, Uttaramati, Vardhamānamati, Anantamati, Vipulamati, Akṣayamati, Dharaṇīdhara, Jagatīṃdhara, Jayamati, Viśeṣamati, and Dhāraṇīśvararāja.

source: སྤོབས་པ་མཐའ་ཡས་པ་ཐོབ་པ། མི་འཇིགས་པ་ཐོགས་པ་མེད་པ་ཐོབ་པ།
en: In addition, the sixty unequaled bodhisattvas headed by Mañjuśrī;

source: རྫུ་འཕྲུལ་གྱི་སྟོབས་དང་། དབང་དམ་པའི་ཕ་རོལ་དུ་སོན་པ་ནས། ཡོན་ཏན་གྱི་ཚོགས་ཐམས་ཅད་ཟད་མི་ཤེས་པ་ཤ་སྟག་ལ་འདི་ལྟ་སྟེ།
en: the sixteen noble men headed by Bhadrapāla;

source: བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་ཀུན་ཏུ་བཟང་པོ་དང་། ཀུན་ཏུ་མིག་དང་། ཀུན་ཏུ་ལྟ་བ་དང་། ཀུན་ཏུ་འོད་ཟེར་དང་། ཀུན་ཏུ་འོད་དང་། བློ་གྲོས་མཆོག་དང་། བློ་གྲོས་འཕེལ་དང་། བློ་གྲོས་མཐའ་ཡས་དང་། བློ་གྲོས་རྒྱ་ཆེན་དང་། བློ་གྲོས་མི་ཟད་པ་དང་། ས་འཛིན་དང་། འགྲོ་བ་འཛིན་དང་། རྒྱལ་བའི་བློ་གྲོས་དང་། ཁྱད་པར་བློ་གྲོས་དང་། བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་དང་། འཇམ་དཔལ་ལ་སོགས་པ་བྱང་ཆུབ་སེམས་དཔའ་དཔེ་མེད་པ་དྲུག་ཅུ་དང་། བཟང་སྐྱོང་ལ་སོགས་པ་སྐྱེས་བུ་དམ་པ་བཅུ་དྲུག་དང་། མི་མཇེད་ཀྱི་བདག་པོ་ཚངས་པ་དང་། ལྷ་ཡི་དབང་པོ་བརྒྱ་བྱིན་དང་། འཇིག་རྟེན་སྐྱོང་བ་བཞི་དང་། ལྷའི་བུ་མཚན་བཟངས་དང་། ལྷའི་བུ་བློ་གྲོས་ལེགས་གནས་དང་། ལྷ་ཡི་དབང་པོ་ཐམས་ཅད་དང་། ཀླུ་ཡི་དབང་པོ་ཐམས་ཅད་དང་། མིའམ་ཅིའི་དབང་པོ་དང་། དྲི་ཟའི་དབང་པོ་དང་། གནོད་སྦྱིན་གྱི་དབང་པོ་དང་། ལྷ་མ་ཡིན་གྱི་དབང་པོ་དང་། ནམ་མཁའ་ལྡིང་གི་དབང་པོ་འཁོར་བརྒྱ་སྟོང་དུ་མ་ཡོད་པ་ཐམས་ཅད་དང་། འཁོར་དེ་ཉིད་དུ་འདུས་ཏེ་འཁོད་པ་རྣམས་དང་ཐབས་གཅིག་ཏུ་བཞུགས་སོ།
en: Brahmā, lord of the Sahā world; Śakra, lord of the gods; the four guardians of the world; the god Susīma; and the god Susthitamati—along with all lords of the gods, lords of the nāgas, lords of the kinnaras, lords of the gandharvas, lords of the yakṣas, lords of the asuras, and lords of the garuḍas, all with their retinues of hundreds of thousands—had assembled and taken their seats.

source: །དེ་ནས་བཅོམ་ལྡན་འདས་དཔལ་གྱི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་བཞུགས་ཏེ། ལྷུན་པོ་ལྟར་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ལས་ནི་མངོན་པར་འཕགས།
en: The Bhagavān was seated on the lion throne at the seat of enlightenment, towering above the whole assembled retinue like Mount Meru.

source: ཉི་མ་ལྟར་འཇིག་རྟེན་ཐམས་ཅད་ལ་ནི་སྣང་། ཟླ་བ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ལ་སྣང་བ་ནི་མཛད། ཚངས་པ་ལྟར་རབ་ཏུ་ཞི་བར་ནི་བཞུགས།
en: Illuminating the entire world like the sun, and all beings like the moon, he remained perfectly at peace like Brahmā.

source: བརྒྱ་བྱིན་ལྟར་སྐུ་ནི་བསྙེན་པར་དཀའ། འཁོར་ལོས་སྒྱུར་བ་ལྟར་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གི་རིན་པོ་ཆེ་བདུན་དང་ནི་ལྡན།
en: His body was difficult to approach like the body of Śakra, and he was endowed with the seven precious branches of enlightenment like a cakravartin.

source: སེང་གེ་ལྟར་ཆོས་ཐམས་ཅད་བདག་མེད་པ་དང་སྟོང་པར་ནི་སྒྲོགས།
en: Like a lion, he proclaimed that all phenomena have no self and are empty.

source: མེའི་ཕུང་པོ་ཆེན་པོ་ལྟར་འགྲོ་བ་ཐམས་ཅད་ལ་སྣང་བའི་སྐུ་དང་ནི་ལྡན། ལྷ་ཐམས་ཅད་སྣང་བའི་ནོར་བུ་རིན་པོ་ཆེ་ཀུན་ནས་བསྡུས་པའི་ནོར་བུ་རིན་པོ་ཆེའི་རྒྱལ་པོ་ལྟར་གཟི་བརྗིད་ཀྱིས་ནི་ཤིན་ཏུ་འབར་ཞིང་སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་སྣང་བས་ཁྱབ་པར་མཛད་ནས། དོན་ཤིན་ཏུ་རྣམ་པར་ངེས་པ། ཆོས་ཐམས་ཅད་ཀྱི་དམ་པའི་ཕ་རོལ་དུ་བྱོན་པ།
en: He was endowed with a body that illuminates the whole world like a huge mass of flames, his radiance blazing brightly like the king of precious jewels among the entire assortment of precious jewels, which is the splendor of all gods. Pervading the trichiliocosm with his splendor, he had become swift in determining the meaning, and had perfectly attained all excellent qualities.

source: འཁོར་གྱི་ནང་ན་བཞུགས་ཤིང་ཚངས་པའི་སྒྲ་དབྱངས་བསྒྲགས་པས་སེམས་ཅན་ཐམས་ཅད་གོ་བར་བྱེད་པ་དང་ལྡན་པའི་དབྱངས་ཀྱིས་ཆོས་སྟོན་ཏེ། ཚངས་པར་སྤྱོད་པ། ཐོག་མར་དགེ་བ། བར་དུ་དགེ་བ།
en: He resided in the assembly, intoned the melodious Brahmā voice, and taught the Dharma, endowed with a speech that makes all sentient beings understand.

source: ཐ་མར་དགེ་བ། དོན་བཟང་པོ། ཚིག་འབྲུ་བཟང་པོ། མ་འདྲེས་པ། ཡོངས་སུ་རྫོགས་པ།
en: He accurately taught pure conduct, the Dharma that is good in the beginning, good in the middle, and good in the end, which is of good meaning, in good words, unadulterated, completely perfect, completely pure, and completely purified.

source: ཡོངས་སུ་དག་པ། ཡོངས་སུ་བྱང་བ་ཡང་དག་པར་རབ་ཏུ་སྟོན་ཏོ། །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུས་པར་གྱུར་ཏེ་འདུག་པ་དེས་བཅོམ་ལྡན་འདས་སེང་གེའི་ཁྲི་ལ་བཞུགས་པ། ཉི་མ་སྟོང་བས་ལྷག་པའི་འོད་ཀྱིས་འཁོར་གྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་ཟིལ་དུ་བརླག་པར་མཛད་ནས་ཤིན་ཏུ་ལྷང་ངེར་བཞུགས་པ་མཐོང་སྟེ།
en: Then the bodhisattva mahāsattva named Prāmodyarāja joined the assembly, was seated, and beheld the Bhagavān seated on the lion throne—the one abiding in splendor outshining the whole gathering of the retinue, with rays of light surpassing a thousand suns.

source: དགའ་བ་དང་། མགུ་བ་དང་། དད་པས་འདུན་པའི་སེམས་ཀྱིས་སྟན་ལས་ལངས་ནས་ཐལ་མོ་སྦྱར་ཏེ་བཅོམ་ལྡན་འདས་ལ་ཚུལ་དང་འཐུན་པའི་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་དོ།
en: With a happy, delighted, and faithfully yearning mind, Prāmodyarāja rose from his seat, joined his palms, and praised the Bhagavān with the following appropriate verses: “Victorious One, you shine like a golden mountain; With your splendor, you outshine beings—

source: །ལྷ་ཚོགས་ལྷ་མ་ཡིན་དང་མིའམ་ཅི།
en: The hosts of gods, asuras, kinnaras,

source: ཀླུ་དང་ཉན་ཐོས་དག་དང་སངས་རྒྱས་སྲས། །འགྲོ་བ་འདི་དག་རྒྱལ་བས་གཟི་ཡངས་ཀྱིས།
en: Nāgas, śrāvakas, and sons of the buddhas.

source: །ཟིལ་མནན་ཁྱོད་ནི་གསེར་གྱི་རི་ལྟར་གསལ།
en: “Just as Mount Meru, the dwelling place of hosts of gods,

source: །རྒྱ་མཚོའི་དབུས་ན་གནས་ཀྱང་རྣམ་མཛེས་པ། །ལྷུན་པོ་ལྷ་ཡི་ཚོགས་ཀྱི་གནས་ལྟ་བུར།
en: Is beautiful, though located in the middle of the ocean,

source: །ཐུགས་རྗེའི་རྒྱ་མཚོའི་དབུས་སུ་དེ་བཞུགས་ཏེ།
en: Out of compassion you dwell in the middle of the ocean of suffering,

source: །འོད་ཟེར་སྟོང་ཕྲག་བརྒྱ་དག་འགྱེད་པར་མཛད།
en: Sending forth hundreds of thousands of light rays.

source: །ཚངས་པའི་གནས་ལ་གནས་པའི་ཚངས་པ་དེ།
en: “Just as Brahmā is magnificent residing in his Brahmā states,

source: །ཚངས་པའི་མདུན་ན་གནས་ཏེ་མངོན་མཛེས་ལྟར།
en: Presiding over his Brahmā realm,

source: །བསམ་གཏན་རྣམ་ཐར་ཏིང་ངེ་འཛིན་བཞུགས་པ།
en: So you, excellent being, residing in meditative absorption, liberation, and concentration,

source: །སེམས་ཅན་དམ་པ་འགྲོ་བ་ཀུན་ལ་གསལ།
en: Illuminate the entire world.

source: །བརྒྱ་བྱིན་སུམ་ཅུ་རྩ་གསུམ་ལྷ་ནང་དུ།
en: “Just as Śakra, residing among the gods in the Heaven of the Thirty-Three,

source: །གནས་ནས་གཟི་བརྗིད་ཡངས་པས་མཛེས་པ་ལྟར།
en: Is gorgeous in all his splendor,

source: །མཚན་གྱིས་སྤྲས་པ་ཡེ་ཤེས་ཡོན་ཏན་ཕྱུག །ཐུབ་པའི་རྒྱལ་པོ་འགྲོ་བ་ཀུན་ལ་གསལ།
en: So you, king of sages, who is adorned with the buddha marks and rich in the qualities of wisdom, Illuminate the entire world.

source: །གླིང་བཞི་མི་ཡི་བདག་པོ་སྣང་ལྡན་པ།
en: “Just as the luminous king of the four continents

source: །འཇིག་རྟེན་འདི་ལ་སྟོན་པ་མཛེས་པ་ལྟར།
en: Shines in the world, making it beautiful, So you, possessing a mind of compassionate intent,

source: །འཕགས་པའི་ལམ་དུ་འཛུད་པ་རབ་མཛད་ཅིང་། །ཐུགས་རྗེའི་དགོངས་པའི་ཐུགས་མངའ་འདི་ཡང་མཛེས།
en: Make beings enter the noble path, making them beautiful.

source: །མཁའ་ལ་ཉི་མ་ལམ་མེ་ཐལ་ལེ་བ།
en: “Just as the sun, shining brightly in the sky,

source: །ནོར་བུ་མེ་འོད་མོག་མོག་བྱེད་འདི་ལྟར།
en: Eclipses the light of the fire jewel,

source: །ཉི་མ་སྟོང་བས་ཁྱད་པར་འཕགས་པའི་འོད།
en: So you, Buddha-sun, shine in this world,

source: །སངས་རྒྱས་ཉི་མ་འགྲོ་བ་འདི་ན་གསལ།
en: With your light exceeding a thousand suns.

source: །དྲི་མེད་ཟླ་བ་ནམ་གྱི་གུང་གསལ་ལྟར།
en: “Just as the stainless moon shines at midnight,

source: །ཤིན་ཏུ་རྣམ་དག་འགྲོ་བ་ཀུན་ལ་གསལ།
en: Completely pure one, illuminating the entire world,

source: །རྒྱལ་བའི་ཞལ་རས་ཟླ་བ་ཉ་བ་འདྲ།
en: So your face, Victorious One, resembles the full moon,

source: །ཀུན་འོད་ཟིལ་གྱིས་མནན་ནས་རྣམ་པར་མཛེས།
en: Outshining all light, radiating exquisitely.

source: །ཇི་ལྟར་རི་བོའི་ཟོམ་ལ་མེ་འབར་བ།
en: “Just as a blazing fire on a mountain peak

source: །མཚན་མོ་མི་ཉལ་ཙམ་ན་ཀུན་སྣང་ལྟར།
en: Illuminates the serene night,

source: །གཏི་མུག་མུན་པ་མ་ལུས་བཅོམ་ནས་ནི།
en: So you have conquered the total darkness of ignorance,

source: །དྲང་སྲོང་ཆེན་པོའི་ཡེ་ཤེས་འོད་ཀྱང་གསལ།།
en: And your wisdom light, great sage, shines forth.

source: སེང་གེ་རི་སུལ་བརྟེན་པའི་སྒྲ་སྒྲོག་ཅིང་།
en: “Just as the lion’s persistent roar, echoing in the mountain ravines,

source: །ས་ལ་རི་དགས་ཚོགས་རྣམས་སྐྲག་བགྱིད་ལྟར།
en: Frightens the herds of deer on the earth,

source: །མི་དབང་སྟོང་པ་བདག་མེད་གསུང་སྒྲོག་ཅིང་།
en: So the lord of men proclaims emptiness and no-self,

source: །ཕ་རོལ་མུ་སྟེགས་ཅན་རྣམས་སྐྲག་པར་མཛད།
en: And frightens the rival tīrthikas.

source: །ནོར་བུའི་རྒྱལ་པོ་བཟང་པོ་གཟི་བརྗིད་འབར།
en: “Just as the genuine king of jewels glows brightly,

source: །ནོར་བུ་ཐམས་ཅད་ཟིལ་མནན་ལམ་མེ་ལྟར།
en: And vividly outshines all other jewels,

source: །རྒྱལ་བའི་སྐུ་ནི་གསེར་གྱི་མདོག་འདྲ་བ།
en: So the body of the Victorious One, in its golden color,

source: །འགྲོ་ཀུན་ཟིལ་གྱིས་མནན་ནས་ལམ་མེར་བཞུགས།
en: Sparkles brilliantly, outshining the whole world. {10} “A being equal or superior to you

source: །འཇིག་རྟེན་གང་ནའང་ཁྱོད་དང་མཚུངས་མ་མཆིས། །ལྷག་པའི་སེམས་ཅན་མཆིས་པར་ག་ལ་འགྱུར།
en: Does not exist anywhere in the world. There is no one to equal you in terms of merit,

source: །བསོད་ནམས་ཡེ་ཤེས་བརྩོན་འགྲུས་ཐབས་རྣམས་དང་། །ཡོན་ཏན་ཀུན་གྱིས་ཁྱོད་དང་མཚུངས་མ་མཆིས།
en: Wisdom, diligence, skillful means, or all qualities.

source: །མི་ཡི་དཔའ་བོ་འགྲོ་ལ་ལམ་མེ་བ།
en: “I have seen the hero of men who illuminates the world,

source: །མགོན་པོ་ཡོན་ཏན་རྒྱ་མཚོ་བདག་གིས་མཐོང་།
en: The ocean of qualities, the protector.

source: །གུས་པ་སྐྱེས་ཤིང་དགའ་བ་རྣམ་པར་འཕེལ།
en: With respect and full of joy,

source: །རྒྱལ་བའི་ཞབས་ཀྱི་མཐིལ་ལ་བདག་གིས་གཏུགས།
en: I bow to the soles of the feet of the Victorious One.

source: །ཡོན་ཏན་ཀུན་གྱི་འབྱུང་གནས་འཇིག་རྟེན་སྒྲོན།
en: “I have praised the source of all qualities, the lamp of the world,

source: །གྲགས་པ་དམ་པ་རྒྱ་ཆེན་ཐུགས་མངའ་ལ།
en: The one whose reputation is well founded and who possesses a vast intellect. May all beings reach supreme enlightenment

source: །བདག་གིས་བསྟོད་དེ་བསོད་ནམས་འདིར་ཐོབ་དེས།
en: Through the merit that has thus been attained.”

source: །འགྲོ་བ་ཐམས་ཅད་བྱང་ཆུབ་མཆོག་རེག་ཤོག །དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོས་བཅོམ་ལྡན་འདས་ལ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་མངོན་པར་བསྟོད་ནས་ཐལ་མོ་སྦྱར་ཏེ། མིག་གཉིས་མི་འཛུམས་པར་དེ་བཞིན་གཤེགས་པའི་སྐུ་ལ་ནི་ལྟ།
en: Then, having praised the Bhagavān with these verses, the bodhisattva mahāsattva Prāmodyarāja joined his palms and, without blinking, gazed at the body of the Tathāgata.

source: ཆོས་ཀྱི་དབྱིངས་ཉིད་ལ་ནི་རྣམ་པར་དཔྱོད།
en: This caused him to investigate the dharmadhātu itself.

source: ཟབ་པ་དང་གཏིང་དཔག་དཀའ་བ་དང་། མཐོང་བར་དཀའ་བ་དང་། ཁོང་དུ་ཆུད་པར་དཀའ་བ་དང་། བརྟག་པར་མི་ནུས་པ་དང་རྟོག་གེའི་སྤྱོད་པ་མ་ཡིན་པ་དང་། ཞི་བ་དང་། ཕྲ་བ་ལ་ནི་འཇུག །སངས་རྒྱས་ཀྱི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ནི་རྗེས་སུ་རྣམ་པར་དཔྱོད།
en: He penetrated the dharmadhātu, which is profound, difficult to fathom, difficult to see, difficult to internalize, impossible to analyze, not reached by reasoning, peaceful, and subtle. He investigated the inconceivable experiential sphere of the Buddha.

source: དེ་བཞིན་གཤེགས་པའི་ཡེ་ཤེས་ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་དུ་ཞུགས་པ་ལ་ནི་རྗེས་སུ་རྣམ་པར་སེམས།
en: He was made to fully understand that the wisdom of the Tathāgata extends to all phenomena.

source: སངས་རྒྱས་ཀྱི་ཡུལ་མི་མཉམ་པ་དང་མཉམ་པ་ལ་ནི་ཡང་དག་པར་ལྟ།
en: He accurately observed that the sphere of the buddhas equals the unequaled.

source: དེ་བཞིན་གཤེགས་པའི་ཐབས་ཀྱི་ཡུལ་གྱི་སྤྱོད་ཡུལ་བསམ་གྱིས་མི་ཁྱབ་པ་ལ་ནི་འཇུག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཆོས་ཀྱི་དབྱིངས་གཅིག་གི་ཚུལ་གྱི་ངོ་བོ་ཉིད་ལ་འཇུག་པ་ལ་ནི་རྟོག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ནི་གནས་མེད་པ་ནམ་མཁའ་སྤྱོད་ཡུལ་དུ་ནི་ཡང་དག་པར་ལྟ།
en: He penetrated the experiential sphere, which is the object of the Tathāgata’s skillful means. He realized that the illustrious buddhas are immersed in the unique nature of the dharmadhātu, and he accurately observed the illustrious buddhas whose experiential spheres are like space, without a basis.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པའི་མཐའ་མཐའ་མ་ཡིན་པའི་རང་བཞིན་ལ་འཇུག་པ་ལ་ནི་མོས། སངས་རྒྱས་ཀྱི་རྣམ་པར་ཐར་པ་སྒྲིབ་པ་མེད་པ་ལ་ནི་མངོན་པར་འདོད།
en: He became convinced that all phenomena are contained in the limit of existence, whose nature is without limit, and he came to strongly desire the unobscured liberation of a buddha.

source: སངས་རྒྱས་བཅོམ་ལྡན་འདས་ཀྱི་སྐུ་རྟག་པ་དང་། ཞི་བ་དང་། ཐེར་ཟུག་པ་ལ་ནི་འཇུག །དེ་བཞིན་གཤེགས་པའི་སྐུ་ཞིང་རབ་འབྱམ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་སོང་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་ཕྱོགས་པ་ལ་ནི་འཇུག །སངས་རྒྱས་བཅོམ་ལྡན་འདས་རྣམས་ཀྱི་ཡོན་ཏན་ཕྱི་མའི་མཐའི་བསྐལ་བའི་མུར་ཐུག་པ་མེད་པ་ནི་རྗེས་སུ་དྲན་པར་བྱེད།
en: He understood that the bodies of the illustrious buddhas are permanent, peaceful, and eternal, and that the bodies of the tathāgatas completely pervade all the limitless buddhafields and manifest to all sentient beings. He was made to recall that the qualities of the illustrious buddhas do not reach an end, even at the endpoints of future eons.

source: ཆོས་ཀྱི་དབྱིངས་ཉིད་ལ་ནི་རྣམ་པར་དཔྱོད་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་མཆོག་ཏུ་དགའ་བའི་རྒྱལ་པོ་ཅང་མི་སྨྲ་བར་འདུག་པར་གྱུར་ཏོ།
en: Investigating the dharmadhātu itself, the bodhisattva mahāsattva Prāmodyarāja stood in silence.

source: །དེའི་ཚེ་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་མཉན་ཡོད་དུ་དབྱར་ཟླ་བ་གསུམ་གནས་པར་དམ་བཅས་ཏེ།
en: Meanwhile, the venerable Rāṣṭrapāla had promised to dwell in Śrāvastī for the three months of the rainy season.

source: དེ་ཟླ་བ་གསུམ་འདས་ནས་ཆོས་གོས་བྱས་ཏེ། ཆོས་གོས་ཟིན་ནས་དེ་ལྷུང་བཟེད་དང་ཆོས་གོས་ཐོགས་ཏེ། དགེ་སློང་གི་དགེ་འདུན་དང་། གསར་བུ་ལས་དང་པོ་པ་རབ་ཏུ་བྱུང་ནས་རིང་པོ་མ་ལོན་པ་དག་དང་ལྷན་ཅིག་ཏུ་མཐར་གྱིས་ཡུལ་རྒྱུ་བ་རྒྱུ་ཞིང་རྒྱལ་པོའི་ཁབ་ཀྱི་གྲོང་ཁྱེར་ཆེན་པོ་ག་ལ་བ་དང་། བྱ་རྒོད་ཀྱི་ཕུང་པོའི་རི་ག་ལ་བ་དེར་སོང་ངོ་།
en: When the three months had passed and his robes had been made and received, he took up his bowl and robes, and together with the assembly of fully ordained monks and the new ones—beginners who had recently become renunciants—he proceeded to roam the country, walking toward the great city of Rājagṛha and Vulture’s Peak.

source: །དེ་ནས་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་བཅོམ་ལྡན་འདས་ག་ལ་བ་དེར་སོང་སྟེ་ཕྱིན་ནས་བཅོམ་ལྡན་འདས་ཀྱི་ཞབས་ལ་མགོ་བོས་ཕྱག་འཚལ་ཏེ།
en: The venerable Rāṣṭrapāla proceeded to the Bhagavān’s dwelling place, and having reached him, he bowed with his head to the Bhagavān’s feet.

source: བཅོམ་ལྡན་འདས་ལ་ལན་གསུམ་བསྐོར་བ་བྱས་ནས་ཕྱོགས་གཅིག་ཏུ་འདུག་གོ །ཕྱོགས་གཅིག་ཏུ་འདུག་ནས་ཀྱང་ཚེ་དང་ལྡན་པ་ཡུལ་འཁོར་སྐྱོང་གིས་ཐལ་མོ་སྦྱར་ཏེ་ཚིགས་སུ་བཅད་པ་འདི་དག་གིས་བཅོམ་ལྡན་འདས་ལ་མངོན་པར་བསྟོད་དོ།
en: After circumambulating the Bhagavān three times, he sat down to one side. Seated to one side, the venerable Rāṣṭrapāla joined his palms and praised the Bhagavān with the following verses:

source: །མི་མཆོག་འོད་མཛད་པ་ལ་ཕྱག་འཚལ་ལོ།
en: “I pay homage to you, supreme one among men, illuminator.

source: །ནམ་མཁའ་མཚུངས་པའི་ཐུགས་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you whose mind is like the sky.

source: །རྒྱལ་བ་ཡིད་གཉིས་གཅོད་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, Victorious One who eradicates doubts.

source: །སྲིད་གསུམ་མཐར་བྱོན་ཐུབ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, Sage who has gone beyond the three worlds.

source: །ཞིང་རྣམས་བྱེ་བ་རབ་འབྱམ་ཀུན་ཏུ་ཡང་། །འདྲེན་པ་དག་ནི་ཁྱོད་ཀྱི་བསྔགས་པ་གསུང་།
en: “In great millions of buddhafields, the guides proclaim your glory.

source: །རྒྱལ་བའི་སྲས་ཀྱིས་ཐོས་ནས་རབ་དགའ་ཞིང་།
en: Having heard this, the sons of the victorious ones Arrived here, overjoyed to worship you, O Sage,

source: །ཡོན་ཏན་རྒྱ་མཚོ་ཐུབ་པ་མཆོད་དུ་མཆི།
en: You, the one endowed with an ocean of qualities.

source: །བདེ་གཤེགས་ཚུལ་དང་འཐུན་པས་མཆོད་བགྱིས་ཏེ།
en: “Having thus worshiped you in a way befitting a sugata,

source: །ཐུབ་པ་ཆེ་ལས་རྡུལ་བྲལ་ཆོས་ཐོས་ནས།
en: They listen to the immaculate Dharma from you, great Sage,

source: །དེ་དག་ཁྱོད་ཀྱི་ཡོན་ཏན་ཕྲེང་རྗོད་ཅིང་།
en: Praise your garland of qualities,

source: །ཡིད་རབ་དགའ་ནས་རང་གི་ཞིང་དུ་མཆི།
en: And return to their respective buddhafields with their minds overjoyed.

source: །བྱང་ཆུབ་དམ་པ་མཆོག་ནི་ཚོལ་བ་ན།
en: “While you were seeking supreme, excellent enlightenment,

source: །ཁྱོད་ཀྱི་ཐུགས་ནི་སྐྱོ་བ་མི་མངའ་བར།
en: You acted for the sake of sentient beings,

source: །བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་བསམ་ཡས་སུ། །སེམས་ཅན་རྣམས་ཀྱི་ཆེད་དུ་སྤྱོད་པ་སྤྱད།
en: Over inconceivable, myriad eons. Without your mind ever becoming exhausted,

source: །འདྲེན་པ་ཁྱོད་ཀྱིས་སྦྱིན་དང་ཚུལ་ཁྲིམས་སྤྱད།
en: “O guide, you practiced generosity and discipline,

source: །བཟོད་དང་བརྩོན་འགྲུས་དང་ནི་བསམ་གཏན་བསླབས།
en: You trained in patience, diligence, and meditative absorption, and

source: །ཤེས་རབ་ཐབས་དང་དབང་གི་ཕ་རོལ་གཤེགས།
en: You perfected insight, skillful means, and power—

source: །དེས་ན་རྣམ་འདྲེན་ཆེ་ལ་ཕྱག་འཚལ་ལོ།
en: Therefore, I pay homage to you, the great guide.

source: །རྫུ་འཕྲུལ་རྐང་དང་མངོན་ཤེས་མཆོག་ལ་མཁས།
en: “You are skilled in the bases of magical power and in excellent superknowledge,

source: །དབང་པོ་སྟོབས་དང་རྣམ་པར་ཐར་པ་བསླབས།
en: Your sense faculties are trained in strengths and liberation,

source: །སེམས་ཅན་ཀུན་གྱི་སྤྱོད་པ་ཐུགས་ཆུད་རྟོགས།
en: And you have internalized the conduct for all sentient beings—

source: །མཉམ་མེད་ཡེ་ཤེས་མཚོ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, ocean of unequaled wisdom. {19} “Bhagavān, supreme one among men,

source: །འགྲོ་བ་རྣམས་ཀྱི་སེམས་རྒྱུད་རབ་ཏུ་མཁྱེན།
en: You know the mindstreams of sentient beings very well,

source: །སྤྱོད་པ་གང་དང་ཇི་ལྟར་ལས་འབྱུང་དང་། །ཚུལ་སྒོ་གང་གིས་རྣམ་པར་གྲོལ་འགྱུར་བ། །དེ་ནི་བཅོམ་ལྡན་མི་ཡི་མཆོག་གིས་མཁྱེན།
en: What their conduct is, and how their karma arises. You know by which methods they will be liberated.

source: །འདོད་ཆགས་ཞེ་སྡང་གཏི་མུག་འབྱུང་བ་སྤོང་།
en: “And you eliminate desire and hatred, which have ignorance as their origin,

source: །གང་གིས་སེམས་ཅན་ངན་སོང་གསུམ་མཆི་དང་། །གང་གིས་བདེ་འགྲོར་མཆི་བར་འགྱུར་བའི་ལས།
en: And which causes sentient beings go to the three lower realms. You know the karma by which they may go to the higher realms—

source: །འགྲོ་བས་ལེགས་པར་བགྱིས་དང་ནོངས་བགྱིས་མཁྱེན།
en: The right and the wrong karma performed by living beings. “You know all the sugatas—

source: །འགྲོ་ལ་ཕན་མཛད་གང་དག་འདས་རྣམས་དང་། །ད་ལྟར་ལྷ་དང་མི་ཡིས་མཆོད་རྣམས་དང་། །གང་དག་མ་བྱོན་ཡོན་ཏན་མཆོག་མཐར་ཕྱིན།
en: Those who were benefactors for the world in the past, Those who are worshiped by gods and humans in the present, And the future ones who will have perfected supreme virtues.

source: །བདེ་གཤེགས་དེ་དག་ཐམས་ཅད་རབ་ཏུ་མཁྱེན།
en: “You know very well

source: །དག་པའི་ཞིང་དང་ཕུན་སུམ་ཚོགས་འཁོར་དང་། །བྱང་ཆུབ་སེམས་དཔའི་ཚོགས་དང་ཉན་ཐོས་དང་། །དྲང་སྲོང་ཆེན་པོ་རྣམས་ཀྱི་སྐུ་ཚེའི་ཚད།
en: The pure buddhafields and the excellent retinues Of bodhisattvas and śrāvakas, And the lifespans of all the great sages.

source: །རྣམ་པ་ཀུན་ཏུ་མ་ལུས་རྣམ་པར་མཁྱེན།
en: “You know how the Dharma will remain after you have entered nirvāṇa,

source: །མྱ་ངན་འདས་ནས་ཆོས་གནས་ཅི་འདྲ་དང་། །རྒྱལ་བའི་རིང་བསྲེལ་མཆོད་པ་ཅི་འདྲ་དང་། །དེར་ནི་ཆོས་མཛོད་འཛིན་པ་ཅི་འདྲ་བ།
en: How the Victorious One’s relics will be praised, And how the Dharma treasure will be preserved.

source: །དེ་དག་མ་ལུས་མི་ཡི་དམ་པས་མཁྱེན།
en: All of this is known by you, the most excellent of men. “Homage to you, Victorious One, ocean of wisdom,

source: །དུས་གསུམ་རྣམས་སུ་རྟག་པར་སྟོབས་བཅུ་ཡི།
en: Who has always—through the three times —realized the wisdom of one who has the ten strengths,

source: །ཡེ་ཤེས་མཁྱེན་པ་སྒྲིབ་པ་མི་མངའ་འཇུག །ཆོས་རྣམས་ཀུན་ལ་ཐུགས་ནི་ཆགས་མི་མངའ།
en: Who has no obscurations, And who is not attached to any phenomenon. “There is no one equal to you, let alone anyone superior.

source: །ཕྱག་འཚལ་རྒྱལ་བ་ཡེ་ཤེས་མཚོ་ཁྱོད་ལ།
en: Your body is thoroughly adorned with the buddha marks,

source: །ཁྱོད་དང་མཚུངས་མཉམ་མ་མཆིས་ག་ལ་ལྷག །སྐར་མ་རྣམས་ཀྱིས་ནམ་མཁར་སྤྲས་པ་ལྟར། །མཚན་རྣམས་ཀྱིས་ཀྱང་སྐུ་ནི་རབ་སྤྲས་པ།
en: Like the sky adorned with stars.

source: །མི་མཆོག་ཐུབ་པ་མཆོག་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, the supreme one among men, supreme sage.

source: །གཟུགས་ཀྱང་མཚུངས་པ་མ་མཆིས་ཡིད་དུ་མཆི།
en: “Even your bodily form is unequaled and captivating,

source: །ལྷར་བཅས་འགྲོ་བ་ཟིལ་དུ་རླག་པར་བགྱིད།
en: Outshining beings, including the gods.

source: །ཚངས་པ་བརྒྱ་བྱིན་འོག་མིན་ལྷ་ཡི་རྣམས།
en: Brahmā, Śakra, and the Akaniṣṭha gods

source: །ཁྱོད་ཀྱི་སྤྱན་སྔ་དེ་དག་མཛེས་མ་ལགས།
en: Do not seem beautiful in your presence.

source: །ཁྱོད་ནི་གསེར་གྱི་རི་ལྟར་དྲི་མི་མངའ།
en: “You are stainless like the golden mountain,

source: །དབུ་སྣུམ་འཇམ་ཞིང་གཡས་སུ་འཁྱིལ་པར་གནས།
en: And the hair on your head, glossy and smooth, spirals clockwise.

source: །ལྷུན་པོའི་རྒྱལ་པོ་ལྟ་བུར་སྤྱི་གཙུག་འཕགས། །བསོད་ནམས་རྒྱ་ཆེན་བྱུང་བ་ལམ་མེར་བཞུགས།
en: The uṣṇīṣa on your head produced by your extensive merit Shines vividly like Mount Meru, the king of mountains. “The beautiful hair tuft between your eyebrows

source: །འོད་ཟེར་བྱེ་བ་ཁྲག་ཁྲིག་རབ་འགྱེད་ཅིང་། །ཁྱོད་ཀྱི་སྨིན་མའི་མཚམས་ཀྱི་མཛོད་སྤུ་མཛེས།
en: Radiates myriad light rays.

source: །འགྲོ་ལ་ཐུགས་རྗེ་དགོངས་པས་གང་གཟིགས་པ།
en: Your eyes, with which you regard beings with compassionate intent,

source: །སྤྱན་ནི་ཨུད་པལ་འདྲ་ཞིང་ཡིད་དུ་མཆི།
en: Are as captivating as the blue lotus. “Your face, O guide,

source: །ཟླ་ཉ་དྲི་མེད་མཁའ་ལ་ཇི་ལྟ་བ། །རྣམ་འདྲེན་ཁྱོད་ཀྱི་ཞལ་ནི་ལམ་མེ་སྟེ།
en: Is as bright as the full moon in the clear sky.

source: །ལྟ་བའི་སྐྱེ་བོ་ངོམས་པར་མི་འགྱུར་བ།
en: People cannot get enough of seeing you—

source: །ཞལ་བཟངས་མི་ཡི་མཆོག་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to the supreme one among men with the handsome face. “Your gait is like that of a goose, of a peacock,

source: །ངང་པ་རྨ་བྱ་རི་དགས་རྒྱལ་གྱི་སྟབས།
en: And that of the king of deer.

source: །གླང་པོ་དྲེགས་པ་དལ་གྱིས་མཆི་སྟབས་ཀྱིས། །ས་རྣམས་གཡོ་བར་མཛད་ཅིང་རབ་གཤེགས་པ།
en: Walking slowly like a confident elephant, you cause the earth to tremble.

source: །སྟོབས་བཅུ་བརྟུལ་ཞུགས་བརྟན་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, one who is steadfast in the ten strengths and firm observance.

source: །ཕྱག་གི་སོར་མོ་རིང་ཞིང་ཟླུམ་ལ་མཛེས།
en: “The fingers on your hands are long, round, beautiful,

source: །སེན་མོ་ཟངས་མདོག་དག་ཅིང་དྲ་བས་སྤྲས།
en: And adorned with webbing in between, and your fingernails are the color of pure copper.

source: །བཞེངས་ཀྱང་པུས་མོའི་ལྷ་དང་རིག་ཅིང་སླེབ།
en: When you stand up, your hands reach your knees.

source: །སྐུ་མདོག་གསེར་མདོག་འདྲ་ལ་ཕྱག་འཚལ་ལོ།
en: I pay homage to you, whose body is of golden color. “When walking, you adorn the ground with beautiful footprints,

source: །འཁོར་ལོ་དྲ་བས་ཁྱབ་པའི་ཞབས་འདོར་བས། །ས་སྟེང་རི་མོར་མཛད་ཅིང་རབ་ཏུ་གཤེགས།
en: Embellished with the marks of wheels.

source: །ཞབས་ཀྱི་འོད་ཟེར་གྱིས་ནི་ཡོངས་སྨིན་པའི།
en: Ripened by the light rays shining from your footprints,

source: །མི་རྣམས་གུམ་ནས་ལྷ་ཡི་འཇིག་རྟེན་མཆི།
en: People go to the gods’ realm upon their deaths.
